Absorb: A nutrient-draining attack. The user's HP is restored by half the damage taken by the target.
Accelerock: The user smashes into the target at high speed. This move always goes first.
Acid: Opposing Pokémon are attacked with a spray of harsh acid. This may also lower their Sp. Def stats.
Acid Spray: The user spits fluid that works to melt the target. This harshly lowers the target's Sp. Def stat.
Acrobatics: The user nimbly strikes the target. If the user is not holding an item, this attack inflicts massive damage.
Aerial Ace: The user confounds the target with speed, then slashes. This attack never misses.
Aeroblast: A vortex of air is shot at the target to inflict damage. Critical hits land more easily.
Air Cutter: The user launches razor-like wind to slash opposing Pokémon. Critical hits land more easily.
Air Slash: The user attacks with a blade of air that slices even the sky. This may also make the target flinch.
Anchor Shot: The user entangles the target with its anchor chain while attacking. The target becomes unable to flee.
Ancient Power: The user attacks with a prehistoric power. This may also raise all the user's stats at once.
Apple Acid: The user attacks the target with an acidic liquid created from tart apples. This also lowers the target's Sp. Def stat.
Aqua Jet: The user lunges at the target at a speed that makes it almost invisible. This move always goes first.
Aqua Tail: The user attacks by swinging its tail as if it were a vicious wave in a raging storm.
Arm Thrust: The user lets loose a flurry of open-palmed arm thrusts that hit two to five times in a row.
Assurance: If the target has already taken some damage in the same turn, this attack's power is doubled.
Astonish: The user attacks the target while shouting in a startling fashion. This may also make the target flinch.
Attack Order: The user calls out its underlings to pummel the target. Critical hits land more easily.
Aura Sphere: The user lets loose a blast of aura power from deep within its body at the target. This attack never misses.
Aura Wheel: Morpeko attacks and raises its Speed with the energy stored in its cheeks. This move's type changes depending on the user's form.
Aurora Beam: The target is hit with a rainbow-colored beam. This may also lower the target's Attack stat.
Avalanche: The power of this attack move is doubled if the user has been hurt by the target in the same turn.
Barrage: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Beak Blast: The user first heats up its beak, and then it attacks the target. Making direct contact with the Pokémon while it's heating up its beak results in a burn.
Beat Up: The user gets all party Pokémon to attack the target. The more party Pokémon, the greater the number of attacks.
Belch: The user lets out a damaging belch at the target. The user must eat a held Berry to use this move.
Bide: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Bind: Things such as long bodies or tentacles are used to bind and squeeze the target for four to five turns.
Bite: The target is bitten with viciously sharp fangs. This may also make the target flinch.
Blaze Kick: The user launches a kick that lands a critical hit more easily. This may also leave the target with a burn.
Blizzard: A howling blizzard is summoned to strike opposing Pokémon. This may also leave the opposing Pokémon frozen.
Blue Flare: The user attacks by engulfing the target in an intense, yet beautiful, blue flame. This may also leave the target with a burn.
Body Slam: The user drops onto the target with its full body weight. This may also leave the target with paralysis.
Bolt Beak: The user stabs the target with its electrified beak. If the user attacks before the target, the power of this move is doubled.
Bolt Strike: The user surrounds itself with a great amount of electricity and charges its target. This may also leave the target with paralysis.
Bone Club: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Bone Rush: The user strikes the target with a hard bone two to five times in a row.
Bonemerang: The user throws the bone it holds. The bone loops around to hit the target twice—coming and going.
Boomburst: The user attacks everything around it with the destructive power of a terrible, explosive sound.
Bounce: The user bounces up high, then drops on the target on the second turn. This may also leave the target with paralysis.
Branch Poke: The user attacks the target by poking it with a sharply pointed branch.
Brave Bird: The user tucks in its wings and charges from a low altitude. This also damages the user quite a lot.
Breaking Swipe: The user swings its tough tail wildly and attacks opposing Pokémon. This also lowers their Attack stats.
Brick Break: The user attacks with a swift chop. It can also break barriers, such as Light Screen and Reflect.
Brine: If the target's HP is half or less, this attack will hit with double the power.
Brutal Swing: The user swings its body around violently to inflict damage on everything in its vicinity.
Bubble: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Bubble Beam: A spray of bubbles is forcefully ejected at the target. This may also lower the target's Speed stat.
Bug Bite: The user bites the target. If the target is holding a Berry, the user eats it and gains its effect.
Bug Buzz: The user generates a damaging sound wave by vibration. This may also lower the target's Sp. Def stat.
Bulldoze: The user strikes everything around it by stomping down on the ground. This lowers the Speed stats of those hit.
Bullet Punch: The user strikes the target with tough punches as fast as bullets. This move always goes first.
Bullet Seed: The user forcefully shoots seeds at the target two to five times in a row.
Burn Up: To inflict massive damage, the user burns itself out. After using this move, the user will no longer be Fire type.
Charge Beam: The user attacks the target with an electric charge. The user may use any remaining electricity to raise its Sp. Atk stat.
Chatter: The user attacks the target with sound waves of deafening chatter. This confuses the target.
Chip Away: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Circle Throw: The target is thrown, and a different Pokémon is dragged out. In the wild, this ends a battle against a single Pokémon.
Clamp: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Clanging Scales: The user rubs the scales on its entire body and makes a huge noise to attack opposing Pokémon. The user's Defense stat goes down after the attack.
Clear Smog: The user attacks the target by throwing a clump of special mud. All stat changes are returned to normal.
Close Combat: The user fights the target up close without guarding itself. This also lowers the user's Defense and Sp. Def stats.
Comet Punch: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Confusion: The target is hit by a weak telekinetic force. This may also confuse the target.
Constrict: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Core Enforcer: If the Pokémon the user has inflicted damage on have already used their moves, this move eliminates the effect of the target's Ability.
Counter: A retaliation move that counters any physical attack, inflicting double the damage taken.
Covet: The user endearingly approaches the target, then steals the target's held item.
Crabhammer: The target is hammered with a large pincer. Critical hits land more easily.
Cross Chop: The user delivers a double chop with its forearms crossed. Critical hits land more easily.
Cross Poison: A slashing attack with a poisonous blade that may also poison the target. Critical hits land more easily.
Crunch: The user crunches up the target with sharp fangs. This may also lower the target's Defense stat.
Crush Claw: The user slashes the target with hard and sharp claws. This may also lower the target's Defense stat.
Crush Grip: The target is crushed with great force. The more HP the target has left, the greater this move's power.
Cut: The target is cut with a scythe or claw.
Dark Pulse: The user releases a horrible aura imbued with dark thoughts. This may also make the target flinch.
Darkest Lariat: The user swings both arms and hits the target. The target's stat changes don't affect this attack's damage.
Dazzling Gleam: The user damages opposing Pokémon by emitting a powerful flash.
Diamond Storm: The user whips up a storm of diamonds to damage opposing Pokémon. This may also sharply raise the user's Defense stat.
Dig: The user burrows into the ground, then attacks on the next turn.
Disarming Voice: Letting out a charming cry, the user does emotional damage to opposing Pokémon. This attack never misses.
Discharge: The user strikes everything around it by letting loose a flare of electricity. This may also cause paralysis.
Dive: Diving on the first turn, the user floats up and attacks on the next turn.
Dizzy Punch: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Doom Desire: Two turns after this move is used, a concentrated bundle of light blasts the target.
Double Hit: The user slams the target with a long tail, vines, or a tentacle. The target is hit twice in a row.
Double Iron Bash: The user rotates, centering the hex nut in its chest, and then strikes with its arms twice in a row. This may also make the target flinch.
Double Kick: The target is quickly kicked twice in succession using both feet.
Double Slap: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Double-Edge: A reckless, life-risking tackle in which the user rushes the target. This also damages the user quite a lot.
Dragon Breath: The user exhales a mighty gust that inflicts damage. This may also leave the target with paralysis.
Dragon Claw: The user slashes the target with huge sharp claws.
Dragon Darts: The user attacks twice using Dreepy. If there are two targets, this move hits each target once.
Dragon Hammer: The user uses its body like a hammer to attack the target and inflict damage.
Dragon Pulse: The target is attacked with a shock wave generated by the user's gaping mouth.
Dragon Rage: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Dragon Rush: The user tackles the target while exhibiting overwhelming menace. This may also make the target flinch.
Dragon Tail: The target is knocked away, and a different Pokémon is dragged out. In the wild, this ends a battle against a single Pokémon.
Drain Punch: An energy-draining punch. The user's HP is restored by half the damage taken by the target.
Draining Kiss: The user steals the target's HP with a kiss. The user's HP is restored by over half of the damage taken by the target.
Dream Eater: The user eats the dreams of a sleeping target. The user's HP is restored by half the damage taken by the target.
Drill Peck: A corkscrewing attack that strikes the target with a sharp beak acting as a drill.
Drill Run: The user crashes into its target while rotating its body like a drill. Critical hits land more easily.
Drum Beating: The user plays its drum, controlling the drum's roots to attack the target. This also lowers the target's Speed stat.
Dual Chop: The user attacks its target by hitting it with brutal strikes. The target is hit twice in a row.
Dynamax Cannon: The user unleashes a strong beam from its core. This move deals twice the damage if the target is Dynamaxed.
Dynamic Punch: The user punches the target with full, concentrated power. This confuses the target if it hits.
Earth Power: The user makes the ground under the target erupt with power. This may also lower the target's Sp. Def stat.
Earthquake: The user sets off an earthquake that strikes every Pokémon around it.
Echoed Voice: The user attacks the target with an echoing voice. If this move is used every turn, its power is increased.
Egg Bomb: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Electro Ball: The user hurls an electric orb at the target. The faster the user is than the target, the greater the move's power.
Electroweb: The user attacks and captures opposing Pokémon using an electric net. This lowers their Speed stats.
Ember: The target is attacked with small flames. This may also leave the target with a burn.
Endeavor: This attack move cuts down the target's HP to equal the user's HP.
Energy Ball: The user draws power from nature and fires it at the target. This may also lower the target's Sp. Def stat.
Eruption: The user attacks opposing Pokémon with explosive fury. The lower the user's HP, the lower the move's power.
Eternabeam: This is Eternatus's most powerful attack in its original form. The user can't move on the next turn.
Explosion: The user attacks everything around it by causing a tremendous explosion. The user faints upon using this move.
Extrasensory: The user attacks with an odd, unseeable power. This may also make the target flinch.
Extreme Speed: The user charges the target at blinding speed. This move always goes first.
Facade: This attack move doubles its power if the user is poisoned, burned, or paralyzed.
Fairy Wind: The user stirs up a fairy wind and strikes the target with it.
Fake Out: This attack hits first and makes the target flinch. It only works the first turn each time the user enters battle.
False Surrender: The user pretends to bow its head, but then it stabs the target with its disheveled hair. This attack never misses.
False Swipe: A restrained attack that prevents the target from fainting. The target is left with at least 1 HP.
Feint: This attack hits a target using a move such as Protect or Detect. This also lifts the effects of those moves.
Feint Attack: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Fell Stinger: When the user knocks out a target with this move, the user's Attack stat rises drastically.
Fiery Dance: Cloaked in flames, the user attacks the target by dancing and flapping its wings. This may also raise the user's Sp. Atk stat.
Final Gambit: The user risks everything to attack its target. The user faints but does damage equal to its HP.
Fire Blast: The target is attacked with an intense blast of all-consuming fire. This may also leave the target with a burn.
Fire Fang: The user bites with flame-cloaked fangs. This may also make the target flinch or leave it with a burn.
Fire Lash: The user strikes the target with a burning lash. This also lowers the target's Defense stat.
Fire Punch: The target is punched with a fiery fist. This may also leave the target with a burn.
Fire Spin: The target becomes trapped within a fierce vortex of fire that rages for four to five turns.
First Impression: Although this move has great power, it only works the first turn each time the user enters battle.
Fishious Rend: The user rends the target with its hard gills. If the user attacks before the target, the power of this move is doubled.
Fissure: The user opens up a fissure in the ground and drops the target in. The target faints instantly if this attack hits.
Flail: The user flails about aimlessly to attack. The less HP the user has, the greater the move's power.
Flame Burst: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Flame Charge: Cloaking itself in flame, the user attacks the target. Then, building up more power, the user raises its Speed stat.
Flame Wheel: The user cloaks itself in fire and charges at the target. This may also leave the target with a burn.
Flamethrower: The target is scorched with an intense blast of fire. This may also leave the target with a burn.
Flare Blitz: The user cloaks itself in fire and charges the target. This also damages the user quite a lot. This attack may leave the target with a burn.
Flash Cannon: The user gathers all its light energy and releases it all at once. This may also lower the target's Sp. Def stat.
Fleur Cannon: The user unleashes a strong beam. The attack's recoil harshly lowers the user's Sp. Atk stat.
Fling: The user flings its held item at the target to attack. This move's power and effects depend on the item.
Fly: The user flies up into the sky and then strikes its target on the next turn.
Flying Press: The user dives down onto the target from the sky. This move is Fighting and Flying type simultaneously.
Focus Blast: The user heightens its mental focus and unleashes its power. This may also lower the target's Sp. Def stat.
Focus Punch: The user focuses its mind before launching a punch. This move fails if the user is hit before it is used.
Force Palm: The target is attacked with a shock wave. This may also leave the target with paralysis.
Foul Play: The user turns the target's power against it. The higher the target's Attack stat, the greater the damage it deals.
Freeze Shock: On the second turn, the user hits the target with electrically charged ice. This may also leave the target with paralysis.
Freeze-Dry: The user rapidly cools the target. This may also leave the target frozen. This move is super effective on Water types.
Frost Breath: The user blows its cold breath on the target. This attack always results in a critical hit.
Frustration: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Fury Attack: The target is jabbed repeatedly with a horn or beak two to five times in a row.
Fury Cutter: The target is slashed with scythes or claws. This attack becomes more powerful if it hits in succession.
Fury Swipes: The target is raked with sharp claws or scythes quickly two to five times in a row.
Fusion Bolt: The user throws down a giant lightning bolt. This move's power is increased when influenced by an enormous flame.
Fusion Flare: The user brings down a giant flame. This move's power is increased when influenced by an enormous lightning bolt.
Future Sight: Two turns after this move is used, a hunk of psychic energy attacks the target.
Gear Grind: The user attacks by throwing steel gears at its target twice.
Giga Drain: A nutrient-draining attack. The user's HP is restored by half the damage taken by the target.
Giga Impact: The user charges at the target using every bit of its power. The user can't move on the next turn.
Glaciate: The user attacks by blowing freezing cold air at opposing Pokémon. This lowers their Speed stats.
Grass Knot: The user snares the target with grass and trips it. The heavier the target, the greater the move's power.
Grav Apple: The user inflicts damage by dropping an apple from high above. This also lowers the target's Defense stat.
Guillotine: A vicious, tearing attack with big pincers. The target faints instantly if this attack hits.
Gunk Shot: The user shoots filthy garbage at the target to attack. This may also poison the target.
Gust: A gust of wind is whipped up by wings and launched at the target to inflict damage.
Gyro Ball: The user tackles the target with a high-speed spin. The slower the user compared to the target, the greater the move's power.
Hammer Arm: The user swings and hits with its strong, heavy fist. It lowers the user's Speed, however.
Head Charge: The user charges its head into its target, using its powerful guard hair. This also damages the user a little.
Head Smash: The user attacks the target with a hazardous, full-power headbutt. This also damages the user terribly.
Headbutt: The user sticks out its head and attacks by charging straight into the target. This may also make the target flinch.
Heart Stamp: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Heat Crash: The user slams its target with its flame-covered body. The more the user outweighs the target, the greater the move's power.
Heat Wave: The user attacks by exhaling hot breath on opposing Pokémon. This may also leave those Pokémon with a burn.
Heavy Slam: The user slams into the target with its heavy body. The more the user outweighs the target, the greater the move's power.
Hex: This relentless attack does massive damage to a target affected by status conditions.
Hidden Power: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
High Horsepower: The user fiercely attacks the target using its entire body.
High Jump Kick: The target is attacked with a knee kick from a jump. If it misses, the user is hurt instead.
Hold Back: The user holds back when it attacks, and the target is left with at least 1 HP.
Horn Attack: The target is jabbed with a sharply pointed horn to inflict damage.
Horn Drill: The user stabs the target with a horn that rotates like a drill. The target faints instantly if this attack hits.
Horn Leech: The user drains the target's energy with its horns. The user's HP is restored by half the damage taken by the target.
Hurricane: The user attacks by wrapping its opponent in a fierce wind that flies up into the sky. This may also confuse the target.
Hydro Pump: The target is blasted by a huge volume of water launched under great pressure.
Hyper Beam: The target is attacked with a powerful beam. The user can't move on the next turn.
Hyper Fang: The user bites hard on the target with its sharp front fangs. This may also make the target flinch.
Hyper Voice: The user lets loose a horribly echoing shout with the power to inflict damage.
Hyperspace Hole: Using a hyperspace hole, the user appears right next to the target and strikes. This also hits a target using a move such as Protect or Detect.
Ice Ball: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Ice Beam: The target is struck with an icy-cold beam of energy. This may also leave the target frozen.
Ice Burn: On the second turn, an ultracold, freezing wind surrounds the target. This may leave the target with a burn.
Ice Fang: The user bites with cold-infused fangs. This may also make the target flinch or leave it frozen.
Ice Hammer: The user swings and hits with its strong, heavy fist. It lowers the user's Speed, however.
Ice Punch: The target is punched with an icy fist. This may also leave the target frozen.
Ice Shard: The user flash-freezes chunks of ice and hurls them at the target. This move always goes first.
Icicle Crash: The user attacks by harshly dropping large icicles onto the target. This may also make the target flinch.
Icicle Spear: The user launches sharp icicles at the target two to five times in a row.
Icy Wind: The user attacks with a gust of chilled air. This also lowers opposing Pokémon's Speed stats.
Incinerate: The user attacks opposing Pokémon with fire. If a Pokémon is holding a certain item, such as a Berry, the item becomes burned up and unusable.
Inferno: The user attacks by engulfing the target in an intense fire. This leaves the target with a burn.
Infestation: The target is infested and attacked for four to five turns. The target can't flee during this time.
Iron Head: The user slams the target with its steel-hard head. This may also make the target flinch.
Iron Tail: The target is slammed with a steel-hard tail. This may also lower the target's Defense stat.
Jaw Lock: This move prevents the user and the target from switching out until either of them faints. The effect goes away if either of the Pokémon leaves the field.
Judgment: The user releases countless shots of light at the target. This move's type varies depending on the kind of Plate the user is holding.
Jump Kick: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Karate Chop: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Knock Off: The user slaps down the target's held item, and that item can't be used in that battle. The move does more damage if the target has a held item.
Land's Wrath: The user gathers the energy of the land and focuses that power on opposing Pokémon to damage them.
Last Resort: This move can be used only after the user has used all the other moves it knows in the battle.
Lava Plume: The user torches everything around it in an inferno of scarlet flames. This may also leave those it hits with a burn.
Leaf Blade: The user handles a sharp leaf like a sword and attacks by cutting its target. Critical hits land more easily.
Leaf Storm: The user whips up a storm of leaves around the target. The attack's recoil harshly lowers the user's Sp. Atk stat.
Leaf Tornado: The user attacks its target by encircling it in sharp leaves. This attack may also lower the target's accuracy.
Leafage: The user attacks by pelting the target with leaves.
Leech Life: The user drains the target's blood. The user's HP is restored by half the damage taken by the target.
Lick: The target is licked with a long tongue, causing damage. This may also leave the target with paralysis.
Liquidation: The user slams into the target using a full-force blast of water. This may also lower the target's Defense stat.
Low Kick: A powerful low kick that makes the target fall over. The heavier the target, the greater the move's power.
Low Sweep: The user makes a swift attack on the target's legs, which lowers the target's Speed stat.
Lunge: The user makes a lunge at the target, attacking with full force. This also lowers the target's Attack stat.
Luster Purge: The user lets loose a damaging burst of light. This may also lower the target's Sp. Def stat.
Mach Punch: The user throws a punch at blinding speed. This move always goes first.
Magical Leaf: The user scatters curious leaves that chase the target. This attack never misses.
Magma Storm: The target becomes trapped within a maelstrom of fire that rages for four to five turns.
Magnet Bomb: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Magnitude: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Mega Drain: A nutrient-draining attack. The user's HP is restored by half the damage taken by the target.
Mega Kick: The target is attacked by a kick launched with muscle-packed power.
Mega Punch: The target is slugged by a punch thrown with muscle-packed power.
Megahorn: Using its tough and impressive horn, the user rams into the target with no letup.
Metal Burst: The user retaliates with much greater force against the opponent that last inflicted damage on it.
Metal Claw: The target is raked with steel claws. This may also raise the user's Attack stat.
Meteor Assault: The user attacks wildly with its thick leek. The user can't move on the next turn, because the force of this move makes it stagger.
Meteor Mash: The target is hit with a hard punch fired like a meteor. This may also raise the user's Attack stat.
Mind Blown: The user attacks everything around it by causing its own head to explode. This also damages the user.
Mirror Coat: A retaliation move that counters any special attack, inflicting double the damage taken.
Mirror Shot: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Mist Ball: A mist-like flurry of down envelops and damages the target. This may also lower the target's Sp. Atk stat.
Moonblast: Borrowing the power of the moon, the user attacks the target. This may also lower the target's Sp. Atk stat.
Moongeist Beam: The user emits a sinister ray to attack the target. This move can be used on the target regardless of its Abilities.
Mud Bomb: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Mud Shot: The user attacks by hurling a blob of mud at the target. This also lowers the target's Speed stat.
Mud-Slap: The user hurls mud in the target's face to inflict damage and lower its accuracy.
Muddy Water: The user attacks by shooting muddy water at opposing Pokémon. This may also lower their accuracy.
Multi-Attack: Cloaking itself in high energy, the user slams into the target. The memory held determines the move's type.
Mystical Fire: The user attacks by breathing a special, hot fire. This also lowers the target's Sp. Atk stat.
Natural Gift: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Nature's Madness: The user hits the target with the force of nature. It halves the target's HP.
Needle Arm: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Night Daze: The user lets loose a pitch-black shock wave at its target. This may also lower the target's accuracy.
Night Shade: The user makes the target see a frightening mirage. It inflicts damage equal to the user's level.
Night Slash: The user slashes the target the instant an opportunity arises. Critical hits land more easily.
Nuzzle: The user attacks by nuzzling its electrified cheeks against the target. This also leaves the target with paralysis.
Oblivion Wing: The user absorbs its target's HP. The user's HP is restored by over half of the damage taken by the target.
Octazooka: The user attacks by spraying ink in the target's face or eyes. This may also lower the target's accuracy.
Ominous Wind: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Origin Pulse: The user attacks opposing Pokémon with countless beams of light that glow a deep and brilliant blue.
Outrage: The user rampages and attacks for two to three turns. The user then becomes confused.
Overdrive: The user attacks opposing Pokémon by twanging a guitar or bass guitar, causing a huge echo and strong vibration.
Overheat: The user attacks the target at full power. The attack's recoil harshly lowers the user's Sp. Atk stat.
Parabolic Charge: The user attacks everything around it. The user's HP is restored by half the damage taken by those hit.
Pay Day: Numerous coins are hurled at the target to inflict damage. Money is earned after the battle.
Payback: The user stores power, then attacks. If the user moves after the target, this attack's power will be doubled.
Peck: The target is jabbed with a sharply pointed beak or horn.
Petal Blizzard: The user stirs up a violent petal blizzard and attacks everything around it.
Petal Dance: The user attacks the target by scattering petals for two to three turns. The user then becomes confused.
Phantom Force: The user vanishes somewhere, then strikes the target on the next turn. This move hits even if the target protects itself.
Photon Geyser: The user attacks a target with a pillar of light. This move inflicts Attack or Sp. Atk damage—whichever stat is higher for the user.
Pin Missile: Sharp spikes are shot at the target in rapid succession. They hit two to five times in a row.
Plasma Fists: The user attacks with electrically charged fists. This move changes Normal-type moves to Electric-type moves.
Play Rough: The user plays rough with the target and attacks it. This may also lower the target's Attack stat.
Pluck: The user pecks the target. If the target is holding a Berry, the user eats it and gains its effect.
Poison Fang: The user bites the target with toxic fangs. This may also leave the target badly poisoned.
Poison Jab: The target is stabbed with a tentacle, arm, or the like steeped in poison. This may also poison the target.
Poison Sting: The user stabs the target with a poisonous stinger. This may also poison the target.
Poison Tail: The user hits the target with its tail. This may also poison the target. Critical hits land more easily.
Pollen Puff: The user attacks the enemy with a pollen puff that explodes. If the target is an ally, it gives the ally a pollen puff that restores its HP instead.
Pound: The target is physically pounded with a long tail, a foreleg, or the like.
Powder Snow: The user attacks with a chilling gust of powdery snow. This may also freeze opposing Pokémon.
Power Gem: The user attacks with a ray of light that sparkles as if it were made of gemstones.
Power Trip: The user boasts its strength and attacks the target. The more the user's stats are raised, the greater the move's power.
Power Whip: The user violently whirls its vines, tentacles, or the like to harshly lash the target.
Power-Up Punch: Striking opponents over and over makes the user's fists harder. Hitting a target raises the Attack stat.
Precipice Blades: The user attacks opposing Pokémon by manifesting the power of the land in fearsome blades of stone.
Present: The user attacks by giving the target a gift with a hidden trap. It restores HP sometimes, however.
Prismatic Laser: The user shoots powerful lasers using the power of a prism. The user can't move on the next turn.
Psybeam: The target is attacked with a peculiar ray. This may also leave the target confused.
Psychic: The target is hit by a strong telekinetic force. This may also lower the target's Sp. Def stat.
Psychic Fangs: The user bites the target with its psychic capabilities. This can also destroy Light Screen and Reflect.
Psycho Boost: The user attacks the target at full power. The attack's recoil harshly lowers the user's Sp. Atk stat.
Psycho Cut: The user tears at the target with blades formed by psychic power. Critical hits land more easily.
Psyshock: The user materializes an odd psychic wave to attack the target. This attack does physical damage.
Psystrike: The user materializes an odd psychic wave to attack the target. This attack does physical damage.
Psywave: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Punishment: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Pursuit: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Pyro Ball: The user attacks by igniting a small stone and launching it as a fiery ball at the target. This may also leave the target with a burn.
Quick Attack: The user lunges at the target at a speed that makes it almost invisible. This move always goes first.
Rage: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Rapid Spin: A spin attack that can also eliminate such moves as Bind, Wrap, and Leech Seed. This also raises the user's Speed stat.
Razor Leaf: Sharp-edged leaves are launched to slash at opposing Pokémon. Critical hits land more easily.
Razor Shell: The user cuts its target with sharp shells. This may also lower the target's Defense stat.
Razor Wind: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Retaliate: The user gets revenge for a fainted ally. If an ally fainted in the previous turn, this move's power is increased.
Return: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Revelation Dance: The user attacks the target by dancing very hard. The user's type determines the type of this move.
Revenge: This attack move's power is doubled if the user has been hurt by the opponent in the same turn.
Reversal: An all-out attack that becomes more powerful the less HP the user has.
Roar of Time: The user blasts the target with power that distorts even time. The user can't move on the next turn.
Rock Blast: The user hurls hard rocks at the target. Two to five rocks are launched in a row.
Rock Climb: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Rock Slide: Large boulders are hurled at opposing Pokémon to inflict damage. This may also make the opposing Pokémon flinch.
Rock Smash: The user attacks with a punch. This may also lower the target's Defense stat.
Rock Throw: The user picks up and throws a small rock at the target to attack.
Rock Tomb: Boulders are hurled at the target. This also lowers the target's Speed stat by preventing its movement.
Rock Wrecker: The user launches a huge boulder at the target to attack. The user can't move on the next turn.
Rolling Kick: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Rollout: The user continually rolls into the target over five turns. It becomes more powerful each time it hits.
Round: The user attacks the target with a song. Others can join in the Round to increase the power of the attack.
Sacred Fire: The target is razed with a mystical fire of great intensity. This may also leave the target with a burn.
Sacred Sword: The user attacks by slicing with a long horn. The target's stat changes don't affect this attack's damage.
Sand Tomb: The user traps the target inside a harshly raging sandstorm for four to five turns.
Scald: The user shoots boiling hot water at its target. This may also leave the target with a burn.
Scratch: Hard, pointed, sharp claws rake the target to inflict damage.
Searing Shot: The user torches everything around it in an inferno of scarlet flames. This may also leave those it hits with a burn.
Secret Power: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Seed Bomb: The user slams a barrage of hard-shelled seeds down on the target from above.
Seed Flare: The user emits a shock wave from its body to attack its target. This may also harshly lower the target's Sp. Def stat.
Seismic Toss: The target is thrown using the power of gravity. It inflicts damage equal to the user's level.
Self-Destruct: The user attacks everything around it by causing an explosion. The user faints upon using this move.
Shadow Ball: The user hurls a shadowy blob at the target. This may also lower the target's Sp. Def stat.
Shadow Bone: The user attacks by beating the target with a bone that contains a spirit. This may also lower the target's Defense stat.
Shadow Claw: The user slashes with a sharp claw made from shadows. Critical hits land more easily.
Shadow Force: The user disappears, then strikes the target on the next turn. This move hits even if the target protects itself.
Shadow Punch: The user throws a punch from the shadows. This attack never misses.
Shadow Sneak: The user extends its shadow and attacks the target from behind. This move always goes first.
Sheer Cold: The target faints instantly. It's less likely to hit the target if it's used by Pokémon other than Ice types.
Shell Trap: The user sets a shell trap. If the user is hit by a physical move, the trap will explode and inflict damage on opposing Pokémon.
Shock Wave: The user strikes the target with a quick jolt of electricity. This attack never misses.
Signal Beam: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Silver Wind: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Sketch: It enables the user to permanently learn the move last used by the target. Once used, Sketch disappears.
Skull Bash: The user tucks in its head to raise its Defense stat on the first turn, then rams the target on the next turn.
Sky Attack: A second-turn attack move where critical hits land more easily. This may also make the target flinch.
Sky Drop: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Sky Uppercut: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Slam: The target is slammed with a long tail, vines, or the like to inflict damage.
Slash: The target is attacked with a slash of claws or blades. Critical hits land more easily.
Sludge: Unsanitary sludge is hurled at the target. This may also poison the target.
Sludge Bomb: Unsanitary sludge is hurled at the target. This may also poison the target.
Sludge Wave: The user strikes everything around it by swamping the area with a giant sludge wave. This may also poison those hit.
Smack Down: The user throws a stone or similar projectile to attack the target. A flying Pokémon will fall to the ground when it's hit.
Smelling Salts: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Smog: The target is attacked with a discharge of filthy gases. This may also poison the target.
Snap Trap: The user snares the target in a snap trap for four to five turns.
Snarl: The user yells as if it's ranting about something, which lowers the Sp. Atk stats of opposing Pokémon.
Snipe Shot: The user ignores the effects of opposing Pokémon's moves and Abilities that draw in moves, allowing this move to hit the chosen target.
Snore: This attack can be used only if the user is asleep. The harsh noise may also make the target flinch.
Solar Beam: In this two-turn attack, the user gathers light, then blasts a bundled beam on the next turn.
Solar Blade: In this two-turn attack, the user gathers light and fills a blade with the light's energy, attacking the target on the next turn.
Sonic Boom: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Spacial Rend: The user tears the target along with the space around it. Critical hits land more easily.
Spark: The user throws an electrically charged tackle at the target. This may also leave the target with paralysis.
Sparkling Aria: The user bursts into song, emitting many bubbles. Any Pokémon suffering from a burn will be healed by the touch of these bubbles.
Spectral Thief: The user hides in the target's shadow, steals the target's stat boosts, and then attacks.
Spike Cannon: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Spirit Break: The user attacks the target with so much force that it could break the target's spirit. This also lowers the target's Sp. Atk stat.
Spirit Shackle: The user attacks while simultaneously stitching the target's shadow to the ground to prevent the target from escaping.
Spit Up: The power stored using the move Stockpile is released at once in an attack. The more power is stored, the greater the move's power.
Steam Eruption: The user immerses the target in superheated steam. This may also leave the target with a burn.
Steamroller: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Steel Wing: The target is hit with wings of steel. This may also raise the user's Defense stat.
Stomp: The target is stomped with a big foot. This may also make the target flinch.
Stomping Tantrum: Driven by frustration, the user attacks the target. If the user's previous move has failed, the power of this move doubles.
Stone Edge: The user stabs the target from below with sharpened stones. Critical hits land more easily.
Stored Power: The user attacks the target with stored power. The more the user's stats are raised, the greater the move's power.
Storm Throw: The user strikes the target with a fierce blow. This attack always results in a critical hit.
Strange Steam: The user attacks the target by emitting steam. This may also confuse the target.
Strength: The target is slugged with a punch thrown at maximum power.
Struggle Bug: While resisting, the user attacks opposing Pokémon. This lowers the Sp. Atk stats of those hit.
Submission: The user grabs the target and recklessly dives for the ground. This also damages the user a little.
Sucker Punch: This move enables the user to attack first. This move fails if the target is not readying an attack.
Sunsteel Strike: The user slams into the target with the force of a meteor. This move can be used on the target regardless of its Abilities.
Super Fang: The user chomps hard on the target with its sharp front fangs. This cuts the target's HP in half.
Superpower: The user attacks the target with great power. However, this also lowers the user's Attack and Defense stats.
Surf: The user attacks everything around it by swamping its surroundings with a giant wave.
Swift: Star-shaped rays are shot at opposing Pokémon. This attack never misses.
Synchronoise: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Tackle: A physical attack in which the user charges and slams into the target with its whole body.
Tail Slap: The user attacks by striking the target with its hard tail. It hits the target two to five times in a row.
Take Down: A reckless, full-body charge attack for slamming into the target. This also damages the user a little.
Techno Blast: The user fires a beam of light at its target. The move's type changes depending on the Drive the user holds.
Thief: The user attacks and steals the target's held item simultaneously. The user can't steal anything if it already holds an item.
Thousand Arrows: This move also hits opposing Pokémon that are in the air. Those Pokémon are knocked down to the ground.
Thrash: The user rampages and attacks for two to three turns. The user then becomes confused.
Throat Chop: The user attacks the target's throat, and the resultant suffering prevents the target from using moves that emit sound for two turns.
Thunder: A wicked thunderbolt is dropped on the target to inflict damage. This may also leave the target with paralysis.
Thunder Fang: The user bites with electrified fangs. This may also make the target flinch or leave it with paralysis.
Thunder Punch: The target is punched with an electrified fist. This may also leave the target with paralysis.
Thunder Shock: A jolt of electricity crashes down on the target to inflict damage. This may also leave the target with paralysis.
Thunderbolt: A strong electric blast crashes down on the target. This may also leave the target with paralysis.
Transform: The user transforms into a copy of the target right down to having the same move set.
Tri Attack: The user strikes with a simultaneous three-beam attack. This may also burn, freeze, or paralyze the target.
Triple Kick: A consecutive three-kick attack that becomes more powerful with each successful hit.
Trop Kick: The user lands an intense kick of tropical origins on the target. This also lowers the target's Attack stat.
Trump Card: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Twineedle: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Twister: The user whips up a vicious tornado to tear at opposing Pokémon. This may also make them flinch.
U-turn: After making its attack, the user rushes back to switch places with a party Pokémon in waiting.
Uproar: The user attacks in an uproar for three turns. During that time, no Pokémon can fall asleep.
Vacuum Wave: The user whirls its fists to send a wave of pure vacuum at the target. This move always goes first.
Venoshock: The user drenches the target in a special poisonous liquid. This move's power is doubled if the target is poisoned.
Vise Grip: The target is gripped and squeezed from both sides to inflict damage.
Vine Whip: The target is struck with slender, whiplike vines to inflict damage.
Vital Throw: The user attacks last. In return, this throw move never misses.
Volt Switch: After making its attack, the user rushes back to switch places with a party Pokémon in waiting.
Wake-Up Slap: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
Water Gun: The target is blasted with a forceful shot of water.
Water Pulse: The user attacks the target with a pulsing blast of water. This may also confuse the target.
Water Shuriken: The user hits the target with throwing stars two to five times in a row. This move always goes first.
Water Spout: The user spouts water to damage opposing Pokémon. The lower the user's HP, the lower the move's power.
Waterfall: The user charges at the target and may make it flinch.
Weather Ball: This attack move varies in power and type depending on the weather.
Whirlpool: The user traps the target in a violent swirling whirlpool for four to five turns.
Wild Charge: The user shrouds itself in electricity and smashes into its target. This also damages the user a little.
Wing Attack: The target is struck with large, imposing wings spread wide to inflict damage.
Wood Hammer: The user slams its rugged body into the target to attack. This also damages the user quite a lot.
Wrap: A long body, vines, or the like are used to wrap and squeeze the target for four to five turns.
Wring Out: This move can't be used. It's recommended that this move is forgotten. Once forgotten, this move can't be remembered.
X-Scissor: The user slashes at the target by crossing its scythes or claws as if they were a pair of scissors.
Zap Cannon: The user fires an electric blast like a cannon to inflict damage and cause paralysis.
Zen Headbutt: The user focuses its willpower to its head and attacks the target. This may also make the target flinch.
Zing Zap: A strong electric blast crashes down on the target, giving it an electric shock. This may also make the target flinch.
