Absorb: User recovers half the damage inflicted.
Accelerock: Has increased Speed Priority
Acid: May lower opponent's Special Defense one stage.
Acid Spray: Lowers opponent's Special Defense two stages.
Acrobatics: Increases damage by 100% if user is not holding an item.
Aerial Ace: Cannot miss.
Aeroblast: Has an increased Critical Hit ratio
Air Cutter: Has an increased Critical Hit ratio
Air Slash: May cause opponent to flinch.
Anchor Shot: Prevents opponent from switching
Ancient Power: May raise all user's stats one stage.
Apple Acid: Lowers opponent's Sp. Def one stage
Aqua Jet: Has increased Speed Priority
Aqua Tail: No effect.
Arm Thrust: Attacks 2-5 times in a row. 37.5% chance of 2 hits. 37.5% chance of 3 hits. 12.5% chance of 4 hits. 12.5% chance of 5 hits
Assurance: Doubles damage if target has already received damage this turn.
Astonish: May cause opponent to flinch.
Attack Order: Has an increased Critical Hit ratio
Aura Sphere: Cannot miss.
Aura Wheel: Raises user's Speed by 1 stage. Changes type to Dark-type if user is in Hangry Mode
Aurora Beam: May lower opponent's Attack one stage.
Avalanche: Power doubles if user was hit before using the Attack.
Barrage: Attacks 2-5 times in a row. 37.5% chance of 2 hits. 37.5% chance of 3 hits. 12.5% chance of 4 hits. 12.5% chance of 5 hits
Beak Blast: Moves first in turn to charge, and last in the same turn to Attack. If opponent makes physical contact between this, the opponent is Burned
Beat Up: Does additional damage for every Pokémon in trainer's team.
Belch: Consumes a Berry
Bide: User takes hits for 2 rounds, then strikes back.
Bind: Traps opponent.
Bite: May cause opponent to flinch.
Blaze Kick: Has high critical hit ratio. May induce burn.
Blizzard: May Freeze opponent.
Blue Flare: May induce burn.
Body Slam: May induce paralysis.
Bolt Beak: Doubles damage if the user moves before the target
Bolt Strike: May induce paralysis.
Bone Club: May cause opponent to flinch.
Bone Rush: Attacks 2-5 times in a row. 37.5% chance of 2 hits. 37.5% chance of 3 hits. 12.5% chance of 4 hits. 12.5% chance of 5 hits
Bonemerang: Attacks twice in a row.
Boomburst: No effect.
Bounce: The user is protected the first turn, Attacks the second turn. May induce Paralysis
Branch Poke: No effect.
Brave Bird: User takes recoil damage equal to a third of the damage inflicted.
Breaking Swipe: Lowers all opponent's Attack one stage
Brick Break: [DEPTH]Destroys protective barriers.
Brine: Doubles damage if target has less than 50% HP
Brutal Swing: In Doubles, if one of the two opponents protects or is a Fairy-type Pokémon, it hits the opponent that doesn't protect twice.
Bubble: May lower opponent's Speed one stage.
Bubble Beam: May lower opponent's Speed one stage.
Bug Bite: Removes target's Berry and uses its effect
Bug Buzz: May lower opponent's Special Defense one stage.
Bulldoze: May lower opponent's Speed one stage.
Bullet Punch: Has increased Speed Priority
Bullet Seed: Attacks 2-5 times in a row. 37.5% chance of 2 hits. 37.5% chance of 3 hits. 12.5% chance of 4 hits. 12.5% chance of 5 hits
Burn Up: Removes Fire-type from user. If user was pure Fire-type, it is now without a type.
Charge Beam: May raise user's Special Attack one stage
Chatter: Confuses the opponent
Chip Away: Ignores stat changes
Circle Throw: Forces opponent to switch Pokémon.
Clamp: Traps opponent.
Clanging Scales: Lowers user's Defense one stage.
Clear Smog: Removes all stat changes
Close Combat: Lowers user's Defense & Special Defense stats by one stage.
Comet Punch: Attacks 2-5 times in a row. 37.5% chance of 2 hits. 37.5% chance of 3 hits. 12.5% chance of 4 hits. 12.5% chance of 5 hits
Confusion: May induce Confusion
Constrict: May lower opponent's Speed one stage.
Core Enforcer: If used after the target Attacks, the target's ability is removed
Counter: If hit by a physical Attack, deals double the damage received.
Covet: May steal opponent's item (temporarily in trainer battles).
Crabhammer: Has an increased Critical Hit ratio
Cross Chop: Has an increased Critical Hit ratio
Cross Poison: Has high critical hit ratio. May induce poison.
Crunch: May lower opponent's Defense one stage.
Crush Claw: May lower opponent's Defense one stage.
Crush Grip: [DEPTH]Increases damage the higher the target's Hit Points
Cut: No effect.
Dark Pulse: May cause opponent to flinch.
Darkest Lariat: Ignores stat changes
Dazzling Gleam: No effect.
Diamond Storm: May raise user's Defense 2 stages
Dig: The user is protected the first turn, Attacks the second turn.
Disarming Voice: Never Misses.
Discharge: May induce paralysis.
Dive: The user is protected the first turn, Attacks the second turn.
Dizzy Punch: May induce Confusion
Doom Desire: Damage delays 2 turns.
Double Hit: Attacks twice in a row.
Double Iron Bash: May cause opponent to flinch.
Double Kick: Attacks twice in a row.
Double Slap: Attacks 2-5 times in a row. 37.5% chance of 2 hits. 37.5% chance of 3 hits. 12.5% chance of 4 hits. 12.5% chance of 5 hits
Double-Edge: User takes recoil damage equal to a third of the damage inflicted.
Dragon Breath: May induce paralysis.
Dragon Claw: No effect.
Dragon Darts: In Doubles, if one of the two opponents protects or is a Fairy-type Pokémon, it hits the opponent that doesn't protect twice.
Dragon Hammer: No effect.
Dragon Pulse: No effect.
Dragon Rage: Inflicts 40 HP damage.
Dragon Rush: May cause opponent to flinch.
Dragon Tail: Forces opponent to switch Pokémon.
Drain Punch: User recovers half the damage inflicted.
Draining Kiss: User recovers 75% the damage inflicted.
Dream Eater: User recovers half the damage inflicted on a sleeping opponent.
Drill Peck: No effect.
Drill Run: Has an increased Critical Hit ratio
Drum Beating: Lowers opponent's Speed one stage.
Dual Chop: Attacks twice in a row.
Dynamax Cannon: Increases damage by 100% if target is Dynamaxed
Dynamic Punch: May induce Confusion
Earth Power: May lower opponent's Special Defense one stage.
Earthquake: Hits everyone on the field.
Echoed Voice: [DEPTH]Increases power if used consecutively
Egg Bomb: No effect.
Electro Ball: [DEPTH]Increases damage based on the Speed of the user and opponent
Electroweb: Lowers opponent's Speed one stage.
Ember: May induce burn.
Endeavor: Reduces the target's Hit Points to match the current Hit Points of the user.
Energy Ball: May lower opponent's Special Defense one stage.
Eruption: [DEPTH]Inflicts more damage when the user's HP is high.
Eternabeam: User cannot Attack on the next turn.
Explosion: User faints
Extrasensory: May cause opponent to flinch.
Extreme Speed: Has increased Speed Priority
Facade: Move's power is doubled if afflicted with a Status Condition
Fairy Wind: No effect.
Fake Out: Causes opponent to flinch.
False Surrender: Never Misses.
False Swipe: Leaves the foe with at least 1 HP.
Feint: Ignores & removes Protect & Detect
Feint Attack: Cannot miss.
Fell Stinger: Raises user's Attack three stages if it knocks the target out.
Fiery Dance: May raise user's Special Attack one stage
Final Gambit: User faints. Does damage to the opponent equal to the amount of lost HP on the user.
Fire Blast: May induce burn.
Fire Fang: May BURN opponent or cause opponent to flinch.
Fire Lash: Lowers opponent's Defense one stage.
Fire Punch: May induce burn.
Fire Spin: Traps opponent.
First Impression: Only works on first turn user is in battle
Fishious Rend: Doubles damage if the user moves before the target
Fissure: May cause one-hit KO.
Flail: Inflicts more damage when the user's HP is down.
Flame Burst: [DEPTH]Damages Pokémon to the side of the target equal to 1/16th of their max Hit Points
Flame Charge: Raises user's Speed one stage.
Flame Wheel: May induce burn.
Flamethrower: May induce burn.
Flare Blitz: User receives 1/3rd of damage in re-coil. May BURN opponent.
Flash Cannon: May lower opponent's Special Defense one stage.
Fleur Cannon: Lowers user's Special Attack two stages.
Fling: [DEPTH]Item's power and effects change based on the user's hold item. User no longer has the hold item.
Fly: The user is protected the first turn, Attacks the second turn.
Flying Press: [DEPTH]Has a secondary Flying-type
Focus Blast: May lower opponent's Special Defense one stage.
Focus Punch: Moves first in turn to charge, and last in the same turn to Attack. If damaged between this, the user flinches.
Force Palm: May induce paralysis.
Foul Play: [DEPTH]Users the opponent's Attack stat in damage calculation
Freeze Shock: May induce paralysis.
Freeze-Dry: [DEPTH]Will always have a Super Effective hit on Water-type Pokémon
Frost Breath: Always inflicts a Critical Hit
Frustration: [DEPTH]The less happy the user, the stronger the Attack.
Fury Attack: Attacks 2-5 times in a row. 37.5% chance of 2 hits. 37.5% chance of 3 hits. 12.5% chance of 4 hits. 12.5% chance of 5 hits
Fury Cutter: Move's power raises next turn if the move is successful.
Fury Swipes: Attacks 2-5 times in a row. 37.5% chance of 2 hits. 37.5% chance of 3 hits. 12.5% chance of 4 hits. 12.5% chance of 5 hits
Fusion Bolt: [DEPTH]Doubles damage if ally used Fusion Flare this turn
Fusion Flare: [DEPTH]Doubles damage if ally used Fusion Bolt this turn
Future Sight: [DEPTH]Damage delays 2 turns.
Gear Grind: Attacks twice in a row.
Giga Drain: User recovers half the damage inflicted.
Giga Impact: User cannot Attack on the next turn.
Glaciate: Lowers opponent's Speed one stage.
Grass Knot: [DEPTH]Damage inflicted raises the heavier the opponent is.
Grav Apple: Lowers opponent's Defense one stage.
Guillotine: May cause one-hit KO.
Gunk Shot: May induce poison.
Gust: Hits opponents using Fly
Gyro Ball: [DEPTH]Increases power the lower the target's Speed
Hammer Arm: Lowers user's Speed one stage.
Head Charge: User takes recoil damage equal to 25% of the damage inflicted.
Head Smash: User receives half the damage inflicted in recoil
Headbutt: May cause opponent to flinch.
Heart Stamp: May cause opponent to flinch.
Heat Crash: [DEPTH]Increases damage based on the weight of the user and opponent
Heat Wave: May induce burn.
Heavy Slam: [DEPTH]Increases damage based on the weight of the user and opponent
Hex: Doubles damage when targed is afflicted with a status condition
Hidden Power: Type depends upon user's IVs.
High Horsepower: No effect.
High Jump Kick: If Attack misses, user takes 1/2 max HP of damage.
Hold Back: Leaves the foe with at least 1 HP.
Horn Attack: No effect.
Horn Drill: May cause one-hit KO.
Horn Leech: User recovers half the damage inflicted.
Hurricane: [DEPTH]May induce CONFUSION. Damages Pokémon using Fly, Bounce or Sky Drop
Hydro Pump: No effect.
Hyper Beam: User cannot Attack on the next turn.
Hyper Fang: May cause opponent to flinch.
Hyper Voice: No effect.
Hyperspace Hole: Hits through Protect
Ice Ball: Uses the same move for 5 turns; move's power raises if it hits.
Ice Beam: May induce freeze.
Ice Burn: May induce burn.
Ice Fang: May FREEZE opponent or cause opponent to flinch.
Ice Hammer: Lowers user's Speed one stage.
Ice Punch: May induce freeze.
Ice Shard: Has increased Speed Priority
Icicle Crash: May cause opponent to flinch.
Icicle Spear: Attacks 2-5 times in a row. 37.5% chance of 2 hits. 37.5% chance of 3 hits. 12.5% chance of 4 hits. 12.5% chance of 5 hits
Icy Wind: May lower opponent's Speed one stage.
Incinerate: Removes opponent's hold berry.
Inferno: May induce burn.
Infestation: Traps opponent.
Iron Head: May cause opponent to flinch.
Iron Tail: May lower opponent's Defense one stage.
Jaw Lock: Prevents both the user and the target from escaping
Judgment: Changes the type of the move based upon the item being held
Jump Kick: If Attack misses, user takes 1/2 max HP of damage.
Karate Chop: Has an increased Critical Hit ratio
Knock Off: [DEPTH]Knocks down opponent's held item to prevent its use. Increases power by 50% if so.
Land's Wrath: No effect.
Last Resort: No effect.
Lava Plume: May induce burn.
Leaf Blade: Has an increased Critical Hit ratio
Leaf Storm: Lowers user's Special Attack two stages.
Leaf Tornado: May lower opponent's Accuracy one stage.
Leafage: No effect.
Leech Life: User recovers half the damage inflicted.
Lick: May induce paralysis.
Liquidation: May lower opponent's Defense one stage.
Low Kick: [DEPTH]Damage inflicted raises the heavier the opponent is.
Low Sweep: Lowers opponent's Speed one stage.
Lunge: Lowers opponent's Attack one stage.
Luster Purge: May lower opponent's Special Defense one stage.
Mach Punch: Has increased Speed Priority
Magical Leaf: Cannot miss.
Magma Storm: Traps opponent.
Magnet Bomb: Cannot miss.
Magnitude: [DEPTH]Move power is random: 10/30/50/70/90/110/150.
Mega Drain: User recovers half the damage inflicted.
Mega Kick: No effect.
Mega Punch: No effect.
Megahorn: No effect.
Metal Burst: Damages the last Pokémon to hit the user with 150% of the damage inflicted on the user
Metal Claw: May raise user's Attack one stage.
Meteor Assault: User cannot Attack on the next turn.
Meteor Mash: May raise user's Attack one stage.
Mind Blown: User loses half their Maximum Hit Points. This effect is ignored by Magic Guard.
Mirror Coat: Counters the foe's special Attack at double the power.
Mirror Shot: May lower opponent's Accuracy one stage.
Mist Ball: May lower opponent's Special Attack one stage.
Moonblast: May lower opponent's Special Attack one stage.
Moongeist Beam: Ignores abilities
Mud Bomb: May lower opponent's Accuracy one stage.
Mud Shot: May lower opponent's Speed one stage.
Mud-Slap: May lower opponent's Accuracy one stage.
Muddy Water: May lower opponent's Accuracy one stage.
Multi-Attack: Changes the type of the move based upon the item being held
Mystical Fire: May lower opponent's Special Attack one stage.
Natural Gift: [DEPTH]Changes type and power based on hold item
Nature's Madness: Cuts the opponent's Hit Points by 50% of the current value
Needle Arm: May cause opponent to flinch.
Night Daze: May lower opponent's Accuracy one stage.
Night Shade: Inflicts damage equal to the user's level.
Night Slash: Has an increased Critical Hit ratio
Nuzzle: Inflicts Paralysis
Oblivion Wing: User recovers 75% the damage inflicted.
Octazooka: May lower opponent's Accuracy one stage.
Ominous Wind: May raise all user's stats one stage.
Origin Pulse: No effect.
Outrage: User uses the same Attack for 2-3 turns then becomes confused.
Overdrive: No effect.
Overheat: Lowers user's Special Attack two stages.
Parabolic Charge: User recovers half the damage inflicted.
Pay Day: User gains money after battle in the main game.
Payback: Doubles damage if user moves after target
Peck: No effect.
Petal Blizzard: No effect.
Petal Dance: User uses the same Attack for 2-3 turns then becomes confused.
Phantom Force: The user is protected the first turn, Attacks the second turn. Hits through Protect
Photon Geyser: Damage inflicted depends on user's Attack or Special Attack. Highest stat used to determine if move is Physical or Special. Ignores abilities
Pin Missile: Attacks 2-5 times in a row. 37.5% chance of 2 hits. 37.5% chance of 3 hits. 12.5% chance of 4 hits. 12.5% chance of 5 hits
Plasma Fists: Changes target's Normal-type move to Electric-type.
Play Rough: May lower opponent's Attack one stage.
Pluck: Removes target's Berry and uses its effect
Poison Fang: May induce severe poison.
Poison Jab: May induce poison.
Poison Sting: May induce poison.
Poison Tail: Has high critical hit ratio. May induce poison.
Pollen Puff: Heals if used on an ally.
Pound: No effect.
Powder Snow: May induce freeze.
Power Gem: No effect.
Power Trip: Increases damage by 100% for each stage a stat has been increased by the user
Power Whip: No effect.
Power-Up Punch: Raises user's Attack by one stage
Precipice Blades: No effect.
Present: May hit or heal the user or the opponent.
Prismatic Laser: User cannot Attack on the next turn.
Psybeam: May induce Confusion
Psychic: May lower opponent's Special Defense one stage.
Psychic Fangs: [DEPTH]Destroys protective barriers.
Psycho Boost: Lowers user's Special Attack two stages.
Psycho Cut: Has an increased Critical Hit ratio
Psyshock: Inflicts physical damage
Psystrike: Inflicts physical damage
Psywave: Inflicts damage equal to 0.5 to 1.5 x  user's level.
Punishment: [DEPTH]Increases damage inflicted based on the opponent's stat boosts
Pursuit: Inflicts double damage if the opponent is switching out.
Pyro Ball: May induce burn.
Quick Attack: Has increased Speed Priority
Rage: User's Attack raises one stage if hit.
Rapid Spin: User removes trapping moves. Increased Speed by 1 stage.
Razor Leaf: Has an increased Critical Hit ratio
Razor Shell: May lower opponent's Defense one stage.
Razor Wind: Has an increased Critical Hit ratio
Retaliate: If a team-mate has been knocked out in the turn before this Pokémon moves, the power is increased by 100%.
Return: [DEPTH]The happier the user, the stronger the Attack.
Revelation Dance: Type varies based on form
Revenge: Power doubles if user was hit before using the Attack.
Reversal: Inflicts more damage when the user's HP is down.
Roar of Time: User cannot Attack on the next turn.
Rock Blast: Attacks 2-5 times in a row. 37.5% chance of 2 hits. 37.5% chance of 3 hits. 12.5% chance of 4 hits. 12.5% chance of 5 hits
Rock Climb: May induce Confusion
Rock Slide: May cause opponent to flinch.
Rock Smash: May lower opponent's Defense one stage.
Rock Throw: No effect.
Rock Tomb: May lower opponent's Speed one stage.
Rock Wrecker: User cannot Attack on the next turn.
Rolling Kick: May cause opponent to flinch.
Rollout: Uses the same move for 5 turns; move's power raises if it hits.
Round: [DEPTH]Increases power if other Pokémon used Round this turn
Sacred Fire: May induce burn.
Sacred Sword: Ignores stat changes
Sand Tomb: Traps opponent.
Scald: May induce burn.
Scratch: No effect.
Searing Shot: May induce burn.
Secret Power: [DEPTH]Afflicts a status condition based on the field
Seed Bomb: No effect.
Seed Flare: Lowers opponent's Special Defense two stages.
Seismic Toss: Inflicts damage equal to the user's level.
Self-Destruct: User faints
Shadow Ball: May lower opponent's Special Defense one stage.
Shadow Bone: May lower opponent's Defense one stage.
Shadow Claw: Has an increased Critical Hit ratio
Shadow Force: The user is protected the first turn, Attacks the second turn. Hits through Protect
Shadow Punch: Cannot miss.
Shadow Sneak: Has increased Speed Priority
Sheer Cold: [DEPTH]May cause one-hit KO.
Shell Trap: If user is hit by a physical Attack after using this move, damage is inflicted
Shock Wave: Cannot miss.
Signal Beam: May induce Confusion
Silver Wind: May raise all user's stats one stage.
Sketch: Copies the opponent's last move forever.
Skull Bash: Raises user's Defense one stage and Attacks next turn.
Sky Attack: May cause opponent to flinch.
Sky Drop: [DEPTH]Rises to the sky and prevents the target Pokémon from using a move in the next turn.
Sky Uppercut: Hits opponents using Fly
Slam: No effect.
Slash: Has an increased Critical Hit ratio
Sludge: May induce poison.
Sludge Bomb: May induce poison.
Sludge Wave: May induce poison.
Smack Down: [DEPTH]Removes target's Ground-type resistance. Damages Pokémon using Fly & Bounce and cancels the move. Damages Pokémon using Sky Drop
Smelling Salts: Doubles damage when targed is afflicted with Paralysis. Heals opponent's Paralysis
Smog: May induce poison.
Snap Trap: Traps opponent.
Snarl: May lower opponent's Special Attack one stage.
Snipe Shot: Ignores move redirection from abilities and moves
Snore: Can only be used while asleep.
Solar Beam: Charges for the first turn, damages on the second. If Sunny Day is in effect, the charge and attack is in the same turn.
Solar Blade: Charges for the first turn, damages on the second. If Sunny Day is in effect, the charge and attack is in the same turn.
Sonic Boom: Inflicts 20 HP damage.
Spacial Rend: Has an increased Critical Hit ratio
Spark: May induce paralysis.
Sparkling Aria: Heals the target from Burn
Spectral Thief: [DEPTH]Steals opponent's stat boosts before doing damage
Spike Cannon: Attacks 2-5 times in a row. 37.5% chance of 2 hits. 37.5% chance of 3 hits. 12.5% chance of 4 hits. 12.5% chance of 5 hits
Spirit Break: Lowers opponent's Sp. Atk one stage
Spirit Shackle: Prevents opponent from switching
Spit Up: [DEPTH]Releases power from STOCKPILE.
Steam Eruption: May induce burn.
Steamroller: May cause opponent to flinch.
Steel Wing: May raise user's Defense one stage.
Stomp: May cause opponent to flinch.
Stomping Tantrum: Doubles damage if last move failed
Stone Edge: Has an increased Critical Hit ratio
Stored Power: [DEPTH]Increases damage by 100% for each stage a stat has been increased by the user
Storm Throw: Always inflicts a Critical Hit
Strange Steam: May induce Confusion
Strength: No effect.
Struggle Bug: May lower opponent's Special Attack one stage.
Submission: User takes recoil damage equal to 25% of the damage inflicted.
Sucker Punch: Damages the opponent only if they are intending to use a damaging move. Fails if used after the opponent moves.
Sunsteel Strike: Ignores abilities
Super Fang: Cuts the opponent's Hit Points by 50% of the current value
Superpower: Lowers user's Attack and Defense one stage.
Surf: May damage diving opponents
Swift: Cannot miss.
Synchronoise: Only damages Pokémon of the same type as the user.
Tackle: No effect.
Tail Slap: Attacks 2-5 times in a row. 37.5% chance of 2 hits. 37.5% chance of 3 hits. 12.5% chance of 4 hits. 12.5% chance of 5 hits
Take Down: User takes recoil damage equal to 25% of the damage inflicted.
Techno Blast: Changes the type of the move based upon the item being held
Thief: May steal opponent's item (temporarily in trainer battles).
Thousand Arrows: Ignores Ground-type Resistance. Knocks Flying/Levitating Pokémon to the ground.
Thrash: User uses the same Attack for 2-3 turns then becomes confused.
Throat Chop: Prevents target from using Sound moves for 2 turns
Thunder: [DEPTH]May induce Paralysis.  Damages Pokémon using Fly, Bounce or Sky Drop
Thunder Fang: May PARALYZE opponent or cause opponent to flinch.
Thunder Punch: May induce paralysis.
Thunder Shock: May induce paralysis.
Thunderbolt: May induce paralysis.
Transform: [DEPTH]User transforms to the opponent.
Tri Attack: May induce burn, freeze or paralysis.
Triple Kick: Attacks 1-3 times in a row.
Trop Kick: Lowers opponent's Attack one stage.
Trump Card: [DEPTH]Increases power the lower its PP
Twineedle: Attacks twice. May induce poison.
Twister: May cause opponent to flinch. Damage is doubled if opponent is using Fly.
U-turn: Pokémon switches out from battle
Uproar: Hits for 3 turns. No Pokémon can be Asleep during that time.
Vacuum Wave: Has increased Speed Priority
Venoshock: Doubles damage inflicted if target is Poisoned
Vise Grip: No effect.
Vine Whip: No effect.
Vital Throw: Cannot miss. Goes last.
Volt Switch: Pokémon switches out from battle
Wake-Up Slap: Heals the target from Sleep
Water Gun: No effect.
Water Pulse: May induce Confusion
Water Shuriken: Attacks 2-5 times in a row. 37.5% chance of 2 hits. 37.5% chance of 3 hits. 12.5% chance of 4 hits. 12.5% chance of 5 hitsBase Power increased to 20 if Battle Bond has activated and will hit 3 times guaranteed.
Water Spout: [DEPTH]Inflicts more damage when the user's HP is high.
Waterfall: May cause opponent to flinch.
Weather Ball: Changes type and doubles power based on the weather in play
Whirlpool: Traps the opponent for 4 to 5 turns
Wild Charge: User takes recoil damage equal to 25% of the damage inflicted.
Wing Attack: No effect.
Wood Hammer: User takes recoil damage equal to a third of the damage inflicted.
Wrap: Traps opponent.
Wring Out: [DEPTH]Increases damage the higher the target's Hit Points
X-Scissor: No effect.
Zap Cannon: May induce paralysis.
Zen Headbutt: May cause opponent to flinch.
Zing Zap: May cause opponent to flinch.
